# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c — стороны предполагаемого треугольника.
# Требуется сравнить длину каждого отрезка-стороны с суммой
# двух других.
# Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
# с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.



a = int(input("Введите размер первой стороны- "))
b = int(input("Введите размер второй стороны- "))
c = int(input("Введите размер третей стороны- "))
if a > b + c or b > a + c or c > a + b:
    print('Треугольника с такими сторонами не существует')
elif a == b != c or a == c != b or c == b != a:
    print("Треугольник равнобедренный")
elif a == b == c:
    print("Треугольник равносторонний")
else:
    print("Треугольник разносторонний")
