# Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
# Используйте правило для проверки: «Число является простым, если делится нацело только на единицу
# и на себя». Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч

x = int(input('Введите число: '))
if x < 0 or x > 100000:
    print('Попробуй еще раз')
elif x > 1:
    _sum = 0
    for i in range(1, x+1):
        if x % i == 0:
            _sum += 1
            print(i)
    if _sum > 2:
        print("составное")
    else:
        print('Простое')